<template>
  <section class="main__info">
    <RFHeading tag="h1">{{ title }}</RFHeading>

    <div class="main__info__toggle">
      <Button
        :class="[
          'main__info__toggle__btn-left',
          { 'btn-disabled': isActive !== 1 },
        ]"
        @click="isActive = 1"
        >{{ btnToggle[0] }}</Button
      >
      <Button
        :class="[
          'main__info__toggle__btn-middle',
          { 'btn-disabled': isActive !== 2 },
        ]"
        @click="isActive = 2"
        >{{ btnToggle[1] }}</Button
      >
      <Button
        :class="[
          'main__info__toggle__btn-right',
          { 'btn-disabled': isActive !== 3 },
        ]"
        @click="isActive = 3"
        >{{ btnToggle[2] }}</Button
      >
    </div>
    <div class="main__info__model">
      <div v-if="isActive === 1" class="main__info__model__woman">
        <WomanBody />
        <div class="main__info__model__woman__accordion">
          <AccordionChooseMyself
            v-for="item in womanData"
            :key="item.id"
            :options="item"
            is-absolute
          />
        </div>
      </div>
      <div v-if="isActive === 2" class="main__info__model__man">
        <ManBody />
        <div class="main__info__model__man__accordion">
          <AccordionChooseMyself
            v-for="item in manData"
            :key="item.id"
            :options="item"
            is-absolute
          />
        </div>
      </div>
      <div v-if="isActive === 3" class="main__info__model__services">
        <div class="main__info__model__services__titles">
          <AccordionChooseMyself
            v-for="item in services"
            :key="item.id"
            :options="item"
            is-absolute
            :choosemyself="true"
          />
        </div>
      </div>
    </div>
  </section>
</template>

<script>
import RFHeading from 'atoms/RFHeading/index.vue'
import WomanBody from 'molecules/WomanBody/index.vue'
import ManBody from 'molecules/ManBody/index.vue'
import AccordionChooseMyself from 'molecules/Accordeon/AccordionChooseMyself/index.vue'

export default {
  name: 'ChooseMyselfInfo',
  components: {
    RFHeading,
    AccordionChooseMyself,
    WomanBody,
    ManBody,
  },
  data() {
    return {
      womanData: [],
      manData: [],
      isActive: 1,
      title: 'Выбираю сам',
      btnToggle: ['Женщина', 'Мужчина', 'Список услуг'],
      services: [
        {
          id: 0,
          title: 'Нервная система',
          links: [
            {
              id: 0,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 1,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 2,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 3,
              title: 'Кальпротектин',
            },
            {
              id: 4,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 5,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 6,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 7,
              title: 'Профиль Паразитозы',
            },
            {
              id: 8,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 9,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
            {
              id: 10,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 11,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 12,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 13,
              title: 'Кальпротектин',
            },
            {
              id: 14,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 15,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 16,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 17,
              title: 'Профиль Паразитозы',
            },
            {
              id: 18,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 19,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
          ],
        },
        {
          id: 1,
          title: 'Щитовидная железа',
          links: [
            {
              id: 0,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 1,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 2,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 3,
              title: 'Кальпротектин',
            },
            {
              id: 4,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 5,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 6,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 7,
              title: 'Профиль Паразитозы',
            },
            {
              id: 8,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 9,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
            {
              id: 10,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 11,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 12,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 13,
              title: 'Кальпротектин',
            },
            {
              id: 14,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 15,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 16,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 17,
              title: 'Профиль Паразитозы',
            },
            {
              id: 18,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 19,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
          ],
        },
        {
          id: 2,
          title: 'Молочная железа',
          links: [
            {
              id: 0,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 1,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 2,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 3,
              title: 'Кальпротектин',
            },
            {
              id: 4,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 5,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 6,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 7,
              title: 'Профиль Паразитозы',
            },
            {
              id: 8,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 9,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
            {
              id: 10,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 11,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 12,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 13,
              title: 'Кальпротектин',
            },
            {
              id: 14,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 15,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 16,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 17,
              title: 'Профиль Паразитозы',
            },
            {
              id: 18,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 19,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
          ],
        },
        {
          id: 3,
          title: 'Печень',
          links: [
            {
              id: 0,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 1,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 2,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 3,
              title: 'Кальпротектин',
            },
            {
              id: 4,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 5,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 6,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 7,
              title: 'Профиль Паразитозы',
            },
            {
              id: 8,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 9,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
            {
              id: 10,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 11,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 12,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 13,
              title: 'Кальпротектин',
            },
            {
              id: 14,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 15,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 16,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 17,
              title: 'Профиль Паразитозы',
            },
            {
              id: 18,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 19,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
          ],
        },
        {
          id: 4,
          title: 'Почки',
          links: [
            {
              id: 0,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 1,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 2,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 3,
              title: 'Кальпротектин',
            },
            {
              id: 4,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 5,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 6,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 7,
              title: 'Профиль Паразитозы',
            },
            {
              id: 8,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 9,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
            {
              id: 10,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 11,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 12,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 13,
              title: 'Кальпротектин',
            },
            {
              id: 14,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 15,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 16,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 17,
              title: 'Профиль Паразитозы',
            },
            {
              id: 18,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 19,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
          ],
        },
        {
          id: 5,
          title: 'Кроветворение',
          links: [
            {
              id: 0,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 1,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 2,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 3,
              title: 'Кальпротектин',
            },
            {
              id: 4,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 5,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 6,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 7,
              title: 'Профиль Паразитозы',
            },
            {
              id: 8,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 9,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
            {
              id: 10,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 11,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 12,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 13,
              title: 'Кальпротектин',
            },
            {
              id: 14,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 15,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 16,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 17,
              title: 'Профиль Паразитозы',
            },
            {
              id: 18,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 19,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
          ],
        },
        {
          id: 6,
          title: 'Имунная система',
          links: [
            {
              id: 0,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 1,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 2,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 3,
              title: 'Кальпротектин',
            },
            {
              id: 4,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 5,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 6,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 7,
              title: 'Профиль Паразитозы',
            },
            {
              id: 8,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 9,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
            {
              id: 10,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 11,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 12,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 13,
              title: 'Кальпротектин',
            },
            {
              id: 14,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 15,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 16,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 17,
              title: 'Профиль Паразитозы',
            },
            {
              id: 18,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 19,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
          ],
        },
        {
          id: 7,
          title: 'Половые органы',
          links: [
            {
              id: 0,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 1,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 2,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 3,
              title: 'Кальпротектин',
            },
            {
              id: 4,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 5,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 6,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 7,
              title: 'Профиль Паразитозы',
            },
            {
              id: 8,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 9,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
            {
              id: 10,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 11,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 12,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 13,
              title: 'Кальпротектин',
            },
            {
              id: 14,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 15,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 16,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 17,
              title: 'Профиль Паразитозы',
            },
            {
              id: 18,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 19,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
          ],
        },
        {
          id: 8,
          title: 'Суставы',
          links: [
            {
              id: 0,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 1,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 2,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 3,
              title: 'Кальпротектин',
            },
            {
              id: 4,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 5,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 6,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 7,
              title: 'Профиль Паразитозы',
            },
            {
              id: 8,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 9,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
            {
              id: 10,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 11,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 12,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 13,
              title: 'Кальпротектин',
            },
            {
              id: 14,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 15,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 16,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 17,
              title: 'Профиль Паразитозы',
            },
            {
              id: 18,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 19,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
          ],
        },
        {
          id: 9,
          title: 'Волосы',
          links: [
            {
              id: 0,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 1,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 2,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 3,
              title: 'Кальпротектин',
            },
            {
              id: 4,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 5,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 6,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 7,
              title: 'Профиль Паразитозы',
            },
            {
              id: 8,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 9,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
            {
              id: 10,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 11,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 12,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 13,
              title: 'Кальпротектин',
            },
            {
              id: 14,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 15,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 16,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 17,
              title: 'Профиль Паразитозы',
            },
            {
              id: 18,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 19,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
          ],
        },
        {
          id: 10,
          title: 'ЛОР-органы',
          links: [
            {
              id: 0,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 1,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 2,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 3,
              title: 'Кальпротектин',
            },
            {
              id: 4,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 5,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 6,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 7,
              title: 'Профиль Паразитозы',
            },
            {
              id: 8,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 9,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
            {
              id: 10,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 11,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 12,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 13,
              title: 'Кальпротектин',
            },
            {
              id: 14,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 15,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 16,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 17,
              title: 'Профиль Паразитозы',
            },
            {
              id: 18,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 19,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
          ],
        },
        {
          id: 11,
          title: 'Паращитовидная железа',
          links: [
            {
              id: 0,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 1,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 2,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 3,
              title: 'Кальпротектин',
            },
            {
              id: 4,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 5,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 6,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 7,
              title: 'Профиль Паразитозы',
            },
            {
              id: 8,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 9,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
            {
              id: 10,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 11,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 12,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 13,
              title: 'Кальпротектин',
            },
            {
              id: 14,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 15,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 16,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 17,
              title: 'Профиль Паразитозы',
            },
            {
              id: 18,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 19,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
          ],
        },
        {
          id: 12,
          title: 'Сердечно-сосудистая система',
          links: [
            {
              id: 0,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 1,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 2,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 3,
              title: 'Кальпротектин',
            },
            {
              id: 4,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 5,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 6,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 7,
              title: 'Профиль Паразитозы',
            },
            {
              id: 8,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 9,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
            {
              id: 10,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 11,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 12,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 13,
              title: 'Кальпротектин',
            },
            {
              id: 14,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 15,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 16,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 17,
              title: 'Профиль Паразитозы',
            },
            {
              id: 18,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 19,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
          ],
        },
        {
          id: 13,
          title: 'Надпочечники',
          links: [
            {
              id: 0,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 1,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 2,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 3,
              title: 'Кальпротектин',
            },
            {
              id: 4,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 5,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 6,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 7,
              title: 'Профиль Паразитозы',
            },
            {
              id: 8,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 9,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
            {
              id: 10,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 11,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 12,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 13,
              title: 'Кальпротектин',
            },
            {
              id: 14,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 15,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 16,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 17,
              title: 'Профиль Паразитозы',
            },
            {
              id: 18,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 19,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
          ],
        },
        {
          id: 14,
          title: 'Поджелудочная железа',
          links: [
            {
              id: 0,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 1,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 2,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 3,
              title: 'Кальпротектин',
            },
            {
              id: 4,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 5,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 6,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 7,
              title: 'Профиль Паразитозы',
            },
            {
              id: 8,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 9,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
            {
              id: 10,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 11,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 12,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 13,
              title: 'Кальпротектин',
            },
            {
              id: 14,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 15,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 16,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 17,
              title: 'Профиль Паразитозы',
            },
            {
              id: 18,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 19,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
          ],
        },
        {
          id: 15,
          title: 'Желудочно-кишечный тракт',
          links: [
            {
              id: 0,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 1,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 2,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 3,
              title: 'Кальпротектин',
            },
            {
              id: 4,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 5,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 6,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 7,
              title: 'Профиль Паразитозы',
            },
            {
              id: 8,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 9,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
            {
              id: 10,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 11,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 12,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 13,
              title: 'Кальпротектин',
            },
            {
              id: 14,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 15,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 16,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 17,
              title: 'Профиль Паразитозы',
            },
            {
              id: 18,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 19,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
          ],
        },
        {
          id: 16,
          title: 'Репродуктивная система (половые гормоны)',
          links: [
            {
              id: 0,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 1,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 2,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 3,
              title: 'Кальпротектин',
            },
            {
              id: 4,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 5,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 6,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 7,
              title: 'Профиль Паразитозы',
            },
            {
              id: 8,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 9,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
            {
              id: 10,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 11,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 12,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 13,
              title: 'Кальпротектин',
            },
            {
              id: 14,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 15,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 16,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 17,
              title: 'Профиль Паразитозы',
            },
            {
              id: 18,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 19,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
          ],
        },
        {
          id: 17,
          title: 'Система гемостаза (свертывание крови)',
          links: [
            {
              id: 0,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 1,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 2,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 3,
              title: 'Кальпротектин',
            },
            {
              id: 4,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 5,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 6,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 7,
              title: 'Профиль Паразитозы',
            },
            {
              id: 8,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 9,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
            {
              id: 10,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 11,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 12,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 13,
              title: 'Кальпротектин',
            },
            {
              id: 14,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 15,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 16,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 17,
              title: 'Профиль Паразитозы',
            },
            {
              id: 18,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 19,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
          ],
        },
        {
          id: 18,
          title: 'Костная система',
          links: [
            {
              id: 0,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 1,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 2,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 3,
              title: 'Кальпротектин',
            },
            {
              id: 4,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 5,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 6,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 7,
              title: 'Профиль Паразитозы',
            },
            {
              id: 8,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 9,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
            {
              id: 10,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 11,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 12,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 13,
              title: 'Кальпротектин',
            },
            {
              id: 14,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 15,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 16,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 17,
              title: 'Профиль Паразитозы',
            },
            {
              id: 18,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 19,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
          ],
        },
        {
          id: 19,
          title: 'Предстательная железа',
          links: [
            {
              id: 0,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 1,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 2,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 3,
              title: 'Кальпротектин',
            },
            {
              id: 4,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 5,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 6,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 7,
              title: 'Профиль Паразитозы',
            },
            {
              id: 8,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 9,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
            {
              id: 10,
              title:
                'Исследование кала(копрограмма) общеклиническое ручным методом',
            },
            {
              id: 11,
              title:
                'Исследование кала на простейшие и гельминты ручным методом',
            },
            {
              id: 12,
              title: 'Определение антигена Helicobacter pylori',
            },
            {
              id: 13,
              title: 'Кальпротектин',
            },
            {
              id: 14,
              title: 'Определение антигена Лямблий в кале',
            },
            {
              id: 15,
              title:
                'Бак. посев кала на дисбактериоз с определением чувствительности к антибиотикам',
            },
            {
              id: 16,
              title:
                'Бак. посев кала на патогенную микрофлору с определением чувствительности к антибиотикам',
            },
            {
              id: 17,
              title: 'Профиль Паразитозы',
            },
            {
              id: 18,
              title:
                '14С-уреазный дыхательный тест на определение Хеликобактер пилори (Helicobacter pylori)',
            },
            {
              id: 19,
              title:
                'Обнаружение скрытой крови в кале качественное ручным методом',
            },
          ],
        },
      ],
    }
  },
  mounted() {
    this.womanData = this.$store.state.womanBody.womanBodyData
    this.manData = this.$store.state.manBody.manBodyData
  },
  updated() {
    this.womanData = this.$store.state.womanBody.womanBodyData
    this.manData = this.$store.state.manBody.manBodyData
  },
}
</script>

<style lang="scss" scoped>
.main__info {
  margin-top: 20px;
  h1.rf-heading {
    text-align: center;
    margin: 0;
    @include medium-tablet {
      @include font-size(45px, 55px, 500);
    }
    @include phone {
      @include font-size(34px, 40px, 500);
    }
    @include small-phone {
      @include font-size(30px, 35px, 500);
    }
  }
  &__toggle {
    background-color: $c-disabled-button-bg;
    border-radius: 6px;
    width: 418px;
    height: 56px;
    align-items: center;
    justify-content: center;
    padding: 4px;
    margin: 30px auto 128px auto;
    box-sizing: border-box;
    @include flex-row();
    @include medium-tablet {
      margin: 30px auto 45px auto;
    }
    @include phone {
      height: auto;
      width: 100%;
      flex-direction: column;
      margin: 25px auto;
    }
    &__btn-left,
    &__btn-middle,
    &__btn-right {
      text-align: center;
      z-index: 10;
      padding: 0 14px;
      height: 48px;
      background: #31b0ed;
      border-radius: 6px;
      cursor: pointer;
      box-sizing: border-box;
      outline: none;
      border: none;
      color: #fff;
      @include font-size(20px, 28px, 400);
      @include medium-tablet {
        @include font-size(18px, 24px, 400);
      }
      @include phone {
        width: 100%;
      }
      @include small-phone {
        height: 40px;
        @include font-size(16px, 20px, 400);
      }
      &:hover {
        background: $c-primary;
      }
    }
  }
  .btn-disabled {
    background-color: $c-disabled-button-bg;
    color: $c-dark;
    border: 1px solid transparent;

    &:hover {
      background-color: $c-disabled-button-bg;
    }
  }
  &__model {
    &__woman,
    &__man {
      position: relative;
      &__accordion {
        display: flex;
        flex-wrap: wrap;
        flex-direction: column;
        max-height: 40em;
        align-content: space-between;
        position: relative;
        @include small-laptop {
          max-height: 44em;
        }
        @include medium-tablet {
          max-height: 33em;
        }
        @include tablet {
          display: block;
          max-height: 100%;
          margin-top: 45em;
        }
      }
    }

    &__services {
      display: flex;
      @include tablet {
        display: block;
      }
      &__titles {
        display: flex;
        flex-direction: column;
      }
    }
  }
}

.wrapper .wrap-menu {
  display: none !important;
}
</style>
